final projectList = [
  {
    "name": "AMZ123合作伙伴",
    "desc": "合作伙伴主要包含以下业务线：这是测试测试这是测试测试这是测试测试",
    "params": ["1预备", "0开发", "1测试", "4完成"]
  },
  {
    "name": "AMZ123用户中心重构",
    "desc": "这是测试测试",
    "params": [
      "1预备",
      "1进行",
      "0开发",
      "1测试",
      "4完成",
      "4完成",
      "4完成",
      "4完成",
      "4完成",
      "4完成"
    ]
  },
  {
    "name": "Job123 v1.0",
    "desc": "相关需求文档https://zfty.yuque.com/123456789",
    "params": ["1预备", "1进行", "0开发", "1测试", "4完成"]
  },
  {
    "name": "业务中台",
    "desc": "",
    "params": ["1预备", "1进行", "0开发", "1测试", "4完成"]
  },
  {
    "name": "业务创新(02.20~02.26)",
    "desc": "",
    "params": ["1预备", "1进行", "0开发", "1测试", "4完成"]
  },
  {
    "name": "业务创新组",
    "desc": "合作伙伴主要包含以下业务线：这是测试测试",
    "params": ["1预备", "1进行", "0开发", "1测试", "4完成"]
  },
  {
    "name": "新人试用",
    "desc": "合作伙伴主要包含以下业务线：这是测试测试",
    "params": ["1预备", "1进行", "0开发", "1测试", "4完成"]
  },
  {
    "name": "研发管理",
    "desc": "合作伙伴主要包含以下业务线：这是测试测试",
    "params": ["1预备", "1进行", "0开发", "1测试", "4完成"]
  }
];

final taskColumns = [
  {"name": "预备", "status": false},
  {"name": "开发", "status": false},
  {"name": "测试", "status": false},
  {"name": "完成", "status": false}
];
final taskColumnList = {
  "预备": [
    {
      'title': "任务一",
      'start_time': '2023-03-02 15:10',
      'end_time': '2023-03-03 18:00',
      'actor': 'Mike'
    },
    {
      'title': "任务二",
      'start_time': '2023-03-12 19:10',
      'end_time': '2023-03-13 18:00',
      'actor': 'Lisa'
    },
    {
      'title': "广告排期",
      'start_time': '2023-03-06 15:10',
      'end_time': '2023-03-08 18:00',
      'actor': 'Lucy'
    },
  ],
  "开发": [
    {
      'title': "广告排期",
      'start_time': '2023-02-06 15:10',
      'end_time': '2023-03-08 18:00',
      'actor': 'Bob'
    },
    {
      'title': "资源排期",
      'start_time': '2023-02-06 10:10',
      'end_time': '2023-02-26 18:00',
      'actor': 'Lily'
    },
  ],
  "测试": [
    {
      'title': "岗位详情页",
      'start_time': '2023-02-06 10:10',
      'end_time': '2023-02-26 18:00',
      'actor': 'Lucky'
    },
    {
      'title': "公司详情页",
      'start_time': '2023-02-06 10:10',
      'end_time': '2023-02-26 18:00',
      'actor': 'Lucky'
    },
    {
      'title': "移动端调整",
      'start_time': '2023-02-06 10:10',
      'end_time': '2023-02-26 18:00',
      'actor': 'Lisa'
    },
  ],
  "完成": []
};
